<a href="https://colab.research.google.com/github/Shin-Sangseok/Google_colab_practice/blob/main/colab_test_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [232]:
print('test')

test

In [233]:
import pandas as pd

In [234]:
import numpy as np

In [235]:
df = pd.read_csv(r'C:\Users\hi\colab\scientists.csv')
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [236]:
#google drive에서 파일을 읽어오는 경우

In [237]:
#from google.colab import drive
#colab이 설치되어있는 리눅스에 구글 드라이브를 연결해야함 
#연결 == mount(마운트)

In [238]:
#drive.mount('/content/drive')

In [239]:
df2= pd.read_csv(r'C:\Users\hi\colab\scientists.csv')
df2

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [240]:
dates = pd.date_range('20190301', periods=6)
dates

DatetimeIndex(['2019-03-01', '2019-03-02', '2019-03-03', '2019-03-04',
               '2019-03-05', '2019-03-06'],
              dtype='datetime64[ns]', freq='D')

In [241]:
np.random.randn(6,4)

array([[ 2.04930371,  0.99966317,  1.24029209, -2.25954644],
       [-0.60199894,  0.09668744,  0.47532549,  1.62910082],
       [-0.08327634,  1.62364747,  1.54094926, -1.20305279],
       [-1.07124323, -0.05041741, -0.03900653,  1.15580125],
       [-1.64602274, -0.02525168, -0.30556734, -0.3652558 ],
       [ 0.46908893,  0.47335607,  0.31180426, -0.28745694]])

In [242]:
df = pd.DataFrame(np.random.randn(6,4), columns=['A','B','C','D'])
#df = df.DataFrame(ndarray(values), columns = ['컬럼명', '컬럼명'...])
df

          A         B         C         D
0 -1.839726  1.233634 -0.973424  1.330855
1  0.540718  0.315070 -0.501314  1.681270
2  2.532386  0.363397 -1.141631 -1.316243
3  0.368285 -0.012047 -1.408730  0.699741
4 -1.151877 -1.851306  0.061594 -0.265624
5  1.360421 -0.948421  0.314555  0.654767

In [243]:
df2 = pd.DataFrame(np.random.randn(6,4),index = dates, columns=['A','B','C','D'])
df2

                   A         B         C         D
2019-03-01 -0.037514 -0.146376 -1.304768  1.581764
2019-03-02  0.023241 -0.407085  2.064289  1.569232
2019-03-03  1.784725  0.503879 -2.152391  1.307705
2019-03-04  0.109863  0.315347 -1.312471 -0.834105
2019-03-05 -0.801658 -0.243724  0.467764 -0.800580
2019-03-06  0.323654 -0.716547  0.284720 -0.005566

In [244]:
type(df2)

pandas.core.frame.DataFrame

In [245]:
df2.index

DatetimeIndex(['2019-03-01', '2019-03-02', '2019-03-03', '2019-03-04',
               '2019-03-05', '2019-03-06'],
              dtype='datetime64[ns]', freq='D')

In [246]:
in1 = df2.index
in1

DatetimeIndex(['2019-03-01', '2019-03-02', '2019-03-03', '2019-03-04',
               '2019-03-05', '2019-03-06'],
              dtype='datetime64[ns]', freq='D')

In [247]:
in1[0]

Timestamp('2019-03-01 00:00:00', freq='D')

In [248]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [249]:
in2 = df.index
in2

RangeIndex(start=0, stop=6, step=1)

In [250]:
in2[2] 
#리스트를 가지고 만든 여러가지 객체들은 리스트처럼 똑같이 다루어도 크게 문제가 발생하지 않는다.

2

In [251]:
ts1 = in1[0]
ts1

Timestamp('2019-03-01 00:00:00', freq='D')

In [252]:
str(ts1)

'2019-03-01 00:00:00'

In [253]:
df['A']

0   -1.839726
1    0.540718
2    2.532386
3    0.368285
4   -1.151877
5    1.360421
Name: A, dtype: float64

In [254]:
type(df['A'])

pandas.core.series.Series

In [255]:
a = df['A']
a

0   -1.839726
1    0.540718
2    2.532386
3    0.368285
4   -1.151877
5    1.360421
Name: A, dtype: float64

In [256]:
a[0]

-1.8397255141092104

In [257]:
a[1]

0.5407182673902287

In [258]:
df2.values

array([[-0.03751441, -0.14637579, -1.30476786,  1.58176361],
       [ 0.02324138, -0.4070845 ,  2.06428936,  1.56923237],
       [ 1.78472519,  0.50387919, -2.15239074,  1.30770482],
       [ 0.10986311,  0.31534709, -1.31247134, -0.83410507],
       [-0.80165838, -0.2437241 ,  0.46776417, -0.80057956],
       [ 0.32365416, -0.71654709,  0.28471999, -0.00556645]])

In [259]:
df2.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.233719 -0.115751 -0.325476  0.469742
std    0.850755  0.454518  1.548117  1.156486
min   -0.801658 -0.716547 -2.152391 -0.834105
25%   -0.022325 -0.366244 -1.310545 -0.601826
50%    0.066552 -0.195050 -0.510024  0.651069
75%    0.270206  0.199916  0.422003  1.503850
max    1.784725  0.503879  2.064289  1.581764

In [260]:
df2.sort_index()

                   A         B         C         D
2019-03-01 -0.037514 -0.146376 -1.304768  1.581764
2019-03-02  0.023241 -0.407085  2.064289  1.569232
2019-03-03  1.784725  0.503879 -2.152391  1.307705
2019-03-04  0.109863  0.315347 -1.312471 -0.834105
2019-03-05 -0.801658 -0.243724  0.467764 -0.800580
2019-03-06  0.323654 -0.716547  0.284720 -0.005566

In [261]:
df2.sort_index(ascending=False)

                   A         B         C         D
2019-03-06  0.323654 -0.716547  0.284720 -0.005566
2019-03-05 -0.801658 -0.243724  0.467764 -0.800580
2019-03-04  0.109863  0.315347 -1.312471 -0.834105
2019-03-03  1.784725  0.503879 -2.152391  1.307705
2019-03-02  0.023241 -0.407085  2.064289  1.569232
2019-03-01 -0.037514 -0.146376 -1.304768  1.581764

In [262]:
df2.sort_values(by='A')

                   A         B         C         D
2019-03-05 -0.801658 -0.243724  0.467764 -0.800580
2019-03-01 -0.037514 -0.146376 -1.304768  1.581764
2019-03-02  0.023241 -0.407085  2.064289  1.569232
2019-03-04  0.109863  0.315347 -1.312471 -0.834105
2019-03-06  0.323654 -0.716547  0.284720 -0.005566
2019-03-03  1.784725  0.503879 -2.152391  1.307705

In [263]:
df2.sort_values(by='A', ascending=False)

                   A         B         C         D
2019-03-03  1.784725  0.503879 -2.152391  1.307705
2019-03-06  0.323654 -0.716547  0.284720 -0.005566
2019-03-04  0.109863  0.315347 -1.312471 -0.834105
2019-03-02  0.023241 -0.407085  2.064289  1.569232
2019-03-01 -0.037514 -0.146376 -1.304768  1.581764
2019-03-05 -0.801658 -0.243724  0.467764 -0.800580

In [264]:
df3 = df2.copy()
df3

                   A         B         C         D
2019-03-01 -0.037514 -0.146376 -1.304768  1.581764
2019-03-02  0.023241 -0.407085  2.064289  1.569232
2019-03-03  1.784725  0.503879 -2.152391  1.307705
2019-03-04  0.109863  0.315347 -1.312471 -0.834105
2019-03-05 -0.801658 -0.243724  0.467764 -0.800580
2019-03-06  0.323654 -0.716547  0.284720 -0.005566

In [265]:
# df3를 B로 정렬해주세요 
# df3의 내용이 변경되어야 합니다.
df3 = df3.sort_values(by='B')
df3

                   A         B         C         D
2019-03-06  0.323654 -0.716547  0.284720 -0.005566
2019-03-02  0.023241 -0.407085  2.064289  1.569232
2019-03-05 -0.801658 -0.243724  0.467764 -0.800580
2019-03-01 -0.037514 -0.146376 -1.304768  1.581764
2019-03-04  0.109863  0.315347 -1.312471 -0.834105
2019-03-03  1.784725  0.503879 -2.152391  1.307705

In [266]:
#변경된 df3에서 b, c만 추출 
df3bc=df3[['B','C']] #밖의 대괄호는 추출의 의미 안의 대괄호는 묶어주는 의미 
df3bc

                   B         C
2019-03-06 -0.716547  0.284720
2019-03-02 -0.407085  2.064289
2019-03-05 -0.243724  0.467764
2019-03-01 -0.146376 -1.304768
2019-03-04  0.315347 -1.312471
2019-03-03  0.503879 -2.152391

In [267]:
#df3의 첫번째 행 첫번째 열의 값을 1로 수정
df3.iloc[0,0]=1 
df3.iloc[0,0]

1.0

In [268]:
#df3에서 0행에서 2행까지 추출 
df3.iloc[0:3] #df.iloc[추출범위]=>행으로 취급! 
#df3.iloc[0:3,:] 이렇게 생략 된 것. 
#df3.iloc[:,0:2] #df3.iloc[추출범위 행, 추출범위 열]=>열로 추출 가능! 
#열은 하나만 쓸 수 없다.

                   A         B         C         D
2019-03-06  1.000000 -0.716547  0.284720 -0.005566
2019-03-02  0.023241 -0.407085  2.064289  1.569232
2019-03-05 -0.801658 -0.243724  0.467764 -0.800580

In [269]:
#df3에서 2019-03-01, A열의 값을 추출 
type(df3.loc['2019-03-01','A'])

pandas.core.series.Series

In [270]:
#df3에서 2019-03-01, A열 ,B열의 값을 추출 
df3.loc['2019-03-01',['A','B']]

                   A         B
2019-03-01 -0.037514 -0.146376

In [271]:
#df3에서 A열의 전체 행을 추출 
df3.loc[:,'A']

2019-03-06    1.000000
2019-03-02    0.023241
2019-03-05   -0.801658
2019-03-01   -0.037514
2019-03-04    0.109863
2019-03-03    1.784725
Name: A, dtype: float64

In [272]:
#df3에서 A,C열의 전체 행을 추출
df3.loc[:,['A','C']]
#loc, iloc의 결과가 1행 인경우 ,Series로 리턴 
#loc, iloc의 결과가 여러 행이면, DataFrame으로 리턴

                   A         C
2019-03-06  1.000000  0.284720
2019-03-02  0.023241  2.064289
2019-03-05 -0.801658  0.467764
2019-03-01 -0.037514 -1.304768
2019-03-04  0.109863 -1.312471
2019-03-03  1.784725 -2.152391

In [273]:
#A열을 추출하여 2번째 값을 추출 
print(type(df3.loc[:,'A']))
df3.loc[:,'A']
#df3.loc[:,'A'].to_list() 

#d53에서 2019-03-01, A열의 값을 추출하여 1번째 값 추출 

#결과가 1행인 경우, Series(list처럼 다루면 된다)

#A열과 C열을 추출하여 1번째행 1번째 열의 값 추출 
#결과가 2행 이상인 경우, DataFrame임 (df로 다루면 된다 )

c = df3.loc[:,['A','C']]
c.iloc[1,1]

<class 'pandas.core.series.Series'>

2.0642893641049653

In [274]:
#df3에서 0번 행렬 추출 
df3.iloc[0,:]

A    1.000000
B   -0.716547
C    0.284720
D   -0.005566
Name: 2019-03-06 00:00:00, dtype: float64

In [275]:
type(df3.iloc[0,:])

pandas.core.series.Series

In [276]:
#df3의 행렬의 크기를 추출 
df3.shape

(6, 4)

In [277]:
df3.T

   2019-03-06  2019-03-02  2019-03-05  2019-03-01  2019-03-04  2019-03-03
A    1.000000    0.023241   -0.801658   -0.037514    0.109863    1.784725
B   -0.716547   -0.407085   -0.243724   -0.146376    0.315347    0.503879
C    0.284720    2.064289    0.467764   -1.304768   -1.312471   -2.152391
D   -0.005566    1.569232   -0.800580    1.581764   -0.834105    1.307705

In [278]:
#df3에서 5행 전체 열 추출 
df3.iloc[5]

A    1.784725
B    0.503879
C   -2.152391
D    1.307705
Name: 2019-03-03 00:00:00, dtype: float64

In [279]:
#df3에서 4행부터 추출 
print(df3)
df3.iloc[4:]

                   A         B         C         D
2019-03-06  1.000000 -0.716547  0.284720 -0.005566
2019-03-02  0.023241 -0.407085  2.064289  1.569232
2019-03-05 -0.801658 -0.243724  0.467764 -0.800580
2019-03-01 -0.037514 -0.146376 -1.304768  1.581764
2019-03-04  0.109863  0.315347 -1.312471 -0.834105
2019-03-03  1.784725  0.503879 -2.152391  1.307705

                   A         B         C         D
2019-03-04  0.109863  0.315347 -1.312471 -0.834105
2019-03-03  1.784725  0.503879 -2.152391  1.307705

In [280]:
#df3에서 0,3행, 1부터 2열까지 추출 
df3.iloc[[0,3],[1,2]]

                   B         C
2019-03-06 -0.716547  0.284720
2019-03-01 -0.146376 -1.304768

In [281]:
#df3에서 1,2,5행, 1,3열 추출 
df3.iloc[[1,2,5],[1,3]]

                   B         D
2019-03-02 -0.407085  1.569232
2019-03-05 -0.243724 -0.800580
2019-03-03  0.503879  1.307705

In [282]:
#df는 기본적으로 행, 열의 위치값을 가지고 있음 
#기본적으로 가지고 있는 위치값을 이용해서 조작하는 경우 
#iloc[]를 사용 
#일부 그래프나 분석시 특정항목을 index항목으로 수동으로 설정해야 하는 경우가 있음 
#특정항목을 index항목으로 설정가능한 경우는 
#"unique/not null한 값을 가지는 항목"만 
#설정 가능 user_id, bbs_id  pk 조건과 일치 
df4 = df2.copy()
df4

                   A         B         C         D
2019-03-01 -0.037514 -0.146376 -1.304768  1.581764
2019-03-02  0.023241 -0.407085  2.064289  1.569232
2019-03-03  1.784725  0.503879 -2.152391  1.307705
2019-03-04  0.109863  0.315347 -1.312471 -0.834105
2019-03-05 -0.801658 -0.243724  0.467764 -0.800580
2019-03-06  0.323654 -0.716547  0.284720 -0.005566

In [283]:
df4.reset_index(inplace=True)

In [284]:
df4.set_index('index', inplace=True)

In [285]:
df4

                   A         B         C         D
index
2019-03-01 -0.037514 -0.146376 -1.304768  1.581764
2019-03-02  0.023241 -0.407085  2.064289  1.569232
2019-03-03  1.784725  0.503879 -2.152391  1.307705
2019-03-04  0.109863  0.315347 -1.312471 -0.834105
2019-03-05 -0.801658 -0.243724  0.467764 -0.800580
2019-03-06  0.323654 -0.716547  0.284720 -0.005566

In [286]:
df4['E']= df4['A']+1 #브로드 캐스팅

In [287]:
df4.columns

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [288]:
df4['E']

index
2019-03-01    0.962486
2019-03-02    1.023241
2019-03-03    2.784725
2019-03-04    1.109863
2019-03-05    0.198342
2019-03-06    1.323654
Name: E, dtype: float64

In [289]:
df4['F'] = 0

In [290]:
df4['F']

index
2019-03-01    0
2019-03-02    0
2019-03-03    0
2019-03-04    0
2019-03-05    0
2019-03-06    0
Name: F, dtype: int64

In [291]:
df4['G'] = range(0,6)
df4['G']

index
2019-03-01    0
2019-03-02    1
2019-03-03    2
2019-03-04    3
2019-03-05    4
2019-03-06    5
Name: G, dtype: int32

In [292]:
df4.reset_index(inplace=True) #reset_index는 일반 컬럼으로 가버림. 
#f4.set_index('G',inplace=True)

In [293]:
#인덱스를 변경하고 싶은 경우, 기존의 인덱스를 살리고 싶으면 
#먼저 reset_index()하고 나서 해야함. 
#reset을 안하는 경우 기존 index는 사라진다. 
df4.set_index('G',inplace=True)

In [294]:
df4

       index         A         B         C         D         E  F
G
0 2019-03-01 -0.037514 -0.146376 -1.304768  1.581764  0.962486  0
1 2019-03-02  0.023241 -0.407085  2.064289  1.569232  1.023241  0
2 2019-03-03  1.784725  0.503879 -2.152391  1.307705  2.784725  0
3 2019-03-04  0.109863  0.315347 -1.312471 -0.834105  1.109863  0
4 2019-03-05 -0.801658 -0.243724  0.467764 -0.800580  0.198342  0
5 2019-03-06  0.323654 -0.716547  0.284720 -0.005566  1.323654  0

In [295]:
df4.columns #G는 인덱스로 잡혀 있어서 눈에 안보이는 것.

Index(['index', 'A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [296]:
df3 = df.copy()
df3

          A         B         C         D
0 -1.839726  1.233634 -0.973424  1.330855
1  0.540718  0.315070 -0.501314  1.681270
2  2.532386  0.363397 -1.141631 -1.316243
3  0.368285 -0.012047 -1.408730  0.699741
4 -1.151877 -1.851306  0.061594 -0.265624
5  1.360421 -0.948421  0.314555  0.654767

In [297]:
import random

In [298]:
#E항목을 파생 변수로 만드세요. 1~10 범위 값 
#F항목을 파생 변수로 만드세요. A열과 C열의 합 
#h항목을 파생변수로 만드세요. 1로 설정
#Z항목을 파생변수로 만드세요. 1~9까지 랜덤한 값

In [299]:
df3['E'] = random.randint(1,10)
df3['E']

0    1
1    1
2    1
3    1
4    1
5    1
Name: E, dtype: int64

In [300]:
df3['F'] = df3['A']+ df3['C']
df3

          A         B         C         D  E         F
0 -1.839726  1.233634 -0.973424  1.330855  1 -2.813150
1  0.540718  0.315070 -0.501314  1.681270  1  0.039404
2  2.532386  0.363397 -1.141631 -1.316243  1  1.390755
3  0.368285 -0.012047 -1.408730  0.699741  1 -1.040445
4 -1.151877 -1.851306  0.061594 -0.265624  1 -1.090283
5  1.360421 -0.948421  0.314555  0.654767  1  1.674976

In [301]:
df3['H'] = 1

In [302]:
#리스트 내포: 결과가 항상 list 
#list comprehension 
#df3['Z'] = [random.randint(1,10) for _ in range(6)]

In [303]:
data = range(1, 11)
data2 = []
for i in range(6):
    data2.append(random.choice(data))
print(data2)
df3['E'] = data2
df3['E']
df3

[3, 5, 1, 3, 6, 6]

          A         B         C         D  E         F  H
0 -1.839726  1.233634 -0.973424  1.330855  3 -2.813150  1
1  0.540718  0.315070 -0.501314  1.681270  5  0.039404  1
2  2.532386  0.363397 -1.141631 -1.316243  1  1.390755  1
3  0.368285 -0.012047 -1.408730  0.699741  3 -1.040445  1
4 -1.151877 -1.851306  0.061594 -0.265624  6 -1.090283  1
5  1.360421 -0.948421  0.314555  0.654767  6  1.674976  1

In [304]:
data2 = []
for _ in range(6):
    data2.append(random.randint(1,10))
data2

[3, 10, 7, 3, 6, 2]

In [305]:
df3['Z'] = data2
df3

          A         B         C         D  E         F  H   Z
0 -1.839726  1.233634 -0.973424  1.330855  3 -2.813150  1   3
1  0.540718  0.315070 -0.501314  1.681270  5  0.039404  1  10
2  2.532386  0.363397 -1.141631 -1.316243  1  1.390755  1   7
3  0.368285 -0.012047 -1.408730  0.699741  3 -1.040445  1   3
4 -1.151877 -1.851306  0.061594 -0.265624  6 -1.090283  1   6
5  1.360421 -0.948421  0.314555  0.654767  6  1.674976  1   2

In [306]:
range(10)

range(0, 10)

In [307]:
list(range(10))

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [308]:
#['반복하면서 한번에 처리할 내용' for i in range(10)]
[i+1 for i in range(10) if i%2 ==0]

#data3 = []
#for i in range(10):
#    if i%2==0:
#        data3.append(i)
#data3

[1, 3, 5, 7, 9]

In [309]:
#['반복하면서 한번에 처리할 내용' for i in range(10) if i / 2 == 0]

In [310]:
name = ['홍길동','김길동','송길동']
for x in name: 
    print(x)

홍길동
김길동
송길동

In [311]:
#name에 들어 있는 모든 데이터에 "님"자를 붙여주세요 
#['반복하면서 한번에 처리할 내용' for i in range(10)]
#[name[i]+"님" for i in range(3)]
[x +'님' for x in name]

['홍길동님', '김길동님', '송길동님']

In [312]:
#name에 들어 있는 각가의 모든 데이터에 앞에 "신입"글자를 붙여주세요 
#['신입'+ name[i] for i in range(3)]
['신입'+x  for x in name]

['신입홍길동', '신입김길동', '신입송길동']

In [313]:
#몇 개가 들어있는지 확인
a_list = range(1,10,2)

In [314]:
count = 0 
result = [count + 1 for x in a_list ] #대괄호 문법은 항상 결과가 리스트로 온다 
sum(result)

5

In [315]:
 #a_list의 각각의 모든 데이터에 0.1을 곱해보세요 변경된 a_list의 합과 평균 
a_list = [x*0.1 for x in a_list]
a_list

[0.1, 0.30000000000000004, 0.5, 0.7000000000000001, 0.9]

In [316]:
sum(a_list)

2.5

In [317]:
np.mean(a_list)

0.5

In [318]:
np.std

In [319]:
[x + 0.1 for x in a_list][:3]

[0.2, 0.4, 0.6]

In [320]:
#df3.drop(columns=['H'], inplace=True)
df3

          A         B         C         D  E         F  H   Z
0 -1.839726  1.233634 -0.973424  1.330855  3 -2.813150  1   3
1  0.540718  0.315070 -0.501314  1.681270  5  0.039404  1  10
2  2.532386  0.363397 -1.141631 -1.316243  1  1.390755  1   7
3  0.368285 -0.012047 -1.408730  0.699741  3 -1.040445  1   3
4 -1.151877 -1.851306  0.061594 -0.265624  6 -1.090283  1   6
5  1.360421 -0.948421  0.314555  0.654767  6  1.674976  1   2

In [326]:
df3.drop(columns=['Z','E','F','H'], inplace=True)

In [330]:
df2.loc['2020-06-25'] = [1,1,1,1] #열의 순서대로 들어감

In [331]:
df2

                            A         B         C         D
2019-03-01 00:00:00 -0.037514 -0.146376 -1.304768  1.581764
2019-03-02 00:00:00  0.023241 -0.407085  2.064289  1.569232
2019-03-03 00:00:00  1.784725  0.503879 -2.152391  1.307705
2019-03-04 00:00:00  0.109863  0.315347 -1.312471 -0.834105
2019-03-05 00:00:00 -0.801658 -0.243724  0.467764 -0.800580
2019-03-06 00:00:00  0.323654 -0.716547  0.284720 -0.005566
2020-06-25           1.000000  1.000000  1.000000  1.000000